; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph4 - mode
	infrared0 - mode
	infrared2 - mode
	image3 - mode
	spectrograph5 - mode
	spectrograph1 - mode
	GroundStation8 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation6 - direction
	Star2 - direction
	Star7 - direction
	GroundStation9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 image3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument3 image3)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation9)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
	(supports instrument6 thermograph4)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 GroundStation6)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation9)
	(supports instrument8 thermograph4)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation9)
	(calibration_target instrument8 Star7)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation9)
)
(:goal (and
	(pointing satellite1 Planet14)
	(pointing satellite2 Star4)
	(have_image Planet10 thermograph4)
	(have_image Planet10 spectrograph1)
	(have_image Star11 image3)
	(have_image Star11 spectrograph5)
	(have_image Star12 infrared0)
	(have_image Star12 spectrograph1)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet14 spectrograph5)
	(have_image Planet14 infrared0)
))

)

; plan
1. (turn_to satellite1 groundstation0 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 11
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite1 star11 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star11)
   goals met: 0 of 11
5. (take_image satellite1 star11 instrument3 spectrograph5)
   added: (have_image star11 spectrograph5)
   goals met: 1 of 11
6. (take_image satellite1 star11 instrument3 image3)
   added: (have_image star11 image3)
   goals met: 2 of 11
7. (turn_to satellite1 phenomenon13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 11
8. (turn_to satellite0 star4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star4)
   goals met: 2 of 11
9. (take_image satellite1 phenomenon13 instrument3 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 11
10. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 3 of 11
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 11
12. (calibrate satellite2 instrument8 groundstation9)
   added: (calibrated instrument8)
   goals met: 3 of 11
13. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 3 of 11
14. (turn_to satellite0 planet10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet10)
   goals met: 3 of 11
15. (take_image satellite0 planet10 instrument0 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 4 of 11
16. (turn_to satellite0 planet14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet14)
   goals met: 4 of 11
17. (take_image satellite0 planet14 instrument0 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 5 of 11
18. (turn_to satellite0 star12 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star12)
   goals met: 5 of 11
19. (take_image satellite0 star12 instrument0 infrared0)
   added: (have_image star12 infrared0)
   goals met: 6 of 11
20. (take_image satellite0 star12 instrument0 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 7 of 11
21. (turn_to satellite1 planet14 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet14)
   goals met: 8 of 11
22. (take_image satellite1 planet14 instrument3 spectrograph5)
   added: (have_image planet14 spectrograph5)
   goals met: 9 of 11
23. (turn_to satellite2 planet10 groundstation9)
   deleted: (pointing satellite2 groundstation9)
   added: (pointing satellite2 planet10)
   goals met: 9 of 11
24. (take_image satellite2 planet10 instrument8 thermograph4)
   added: (have_image planet10 thermograph4)
   goals met: 10 of 11
25. (turn_to satellite2 star4 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star4)
   goals met: 11 of 11
